In [21]:
#10/23
import pandas as pd
import re
import numpy as np
jeopardy = pd.read_csv('./jeopardy.csv')

In [22]:
jeopardy.head()

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,2004-12-31,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was ...",Copernicus
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,The city of Yuma in this state has a record av...,Arizona
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Co...",John Adams

In [23]:
jeopardy.rename(columns={' Air Date':'Air Date', ' Round':'Round', ' Category':'Category', ' Value':'Value', ' Question':'Question', ' Answer':'Answer'}, inplace=True)

In [24]:
jeopardy.columns

Index(['Show Number', 'Air Date', 'Round', 'Category', 'Value', 'Question',
       'Answer'],
      dtype='object')

In [25]:
def count_how_many_rows_with_words_question():
    return jeopardy['Question'].str.contains(r'^(?=.*King)(?=.*England)').sum()
count_how_many_rows_with_words_question()

49

In [26]:
df_with_king_and_england = jeopardy[jeopardy['Question'].str.contains(r'^(?=.*King)(?=.*England)')]
print(df_with_king_and_england)
df_with_king_and_england.Question.count()

        Show Number    Air Date             Round  \
4953           3003  1997-09-24  Double Jeopardy!
14912          2832  1996-12-17         Jeopardy!
21511          4650  2004-11-19         Jeopardy!
23810          4862  2005-11-01         Jeopardy!
27555          1799  1992-05-28  Double Jeopardy!
33294          5589  2008-12-18         Jeopardy!
41148          5925  2010-05-21  Double Jeopardy!
41357          2751  1996-07-15         Jeopardy!
43122          3937  2001-10-16  Double Jeopardy!
47814          4365  2003-07-18  Double Jeopardy!
49994          5499  2008-07-03         Jeopardy!
51115          3574  2000-03-02         Jeopardy!
51565          4264  2003-02-27  Double Jeopardy!
56600          3533  2000-01-05  Double Jeopardy!
57516          4299  2003-04-17  Double Jeopardy!
58949          6250  2011-11-18  Double Jeopardy!
71808          5270  2007-07-06         Jeopardy!
74235          2757  1996-09-03         Jeopardy!
77195          3656  2000-06-26         Jeopardy!
79457          4230  2003-01-10  Double Jeopardy!
80113          5827  2010-01-05         Jeopardy!
84639          1558  1991-05-15         Jeopardy!
86412          1837  1992-09-08  Double Jeopardy!
89710          5390  2008-02-01  Double Jeopardy!
111926         1331  1990-05-21         Jeopardy!
118809         1905  1992-12-11         Jeopardy!
123299         4656  2004-11-29         Jeopardy!
123671         5718  2009-06-17         Jeopardy!
125822         4042  2002-03-12  Double Jeopardy!
127484         1325  1990-05-11  Double Jeopardy!
127758         6021  2010-11-15         Jeopardy!
129106         4906  2006-01-02  Double Jeopardy!
130208         5222  2007-05-01         Jeopardy!
137818         3368  1999-04-07         Jeopardy!
143434         1882  1992-11-10  Double Jeopardy!
150880         4790  2005-06-03  Double Jeopardy!
165110         4255  2003-02-14         Jeopardy!
165197         6272  2011-12-20  Double Jeopardy!
170007         5455  2008-05-02  Double Jeopardy!
174055         2143  1993-12-22  Double Jeopardy!
175259         3055  1997-12-05  Double Jeopardy!
183462         3099  1998-02-05   Final Jeopardy!
186239         5339  2007-11-22  Double Jeopardy!
187651         5264  2007-06-28         Jeopardy!
191579         5453  2008-04-30         Jeopardy!
192265         6292  2012-01-17  Double Jeopardy!
192966         6175  2011-06-17  Double Jeopardy!
194516         6114  2011-03-24  Double Jeopardy!
200369         2937  1997-05-13         Jeopardy!

                            Category   Value  \
4953                    "PH"UN WORDS    $200
14912                  WORLD HISTORY    $100
21511                     THE "O.C."   $1000
23810                  NAME THE YEAR    $400
27555               HISTORIC IN-LAWS    $600
33294            THE BAYEUX TAPESTRY    $600
41148                       TREATIES   $1600
41357                 HISTORIC NAMES    $400
43122                     OH, HENRY!    $400
47814                        POTIONS   $2000
49994                    REIGN DROPS   $1000
51115             ALL THINGS BRITISH    $200
51565             MUSIC APPRECIATION    $800
56600                 FRENCH HISTORY    $600
57516               THE "UN"CATEGORY   $2000
58949            ASSUME THE POSITION   $2000
71808        WHERE THERE'S A WILLIAM   $1000
74235                  WORLD HISTORY    $200
77195                        JUNE 26    $400
79457                     CONQUERORS    $800
80113                      "M" & "M"   $1000
84639              FILMS OF THE '90S    $200
86412                        ROYALTY    $400
89710                 "CAN"NED WORDS   $1600
111926                FILE UNDER "M"  $1,000
118809                KINGS & QUEENS    $300
123299                        CHAIRS    $400
123671          A YEAR ENDING IN '09   $1000
125822              PAINT IT "BLACK"  $5,000
127484               MEDIEVAL PEOPLE    $600
127758                   STATE FACTS    $600
129106            HISTORIC NICKNAMES   $2000
130208                       ROYALTY    $600
137818             PEOPLE IN HISTORY    $400
143434                           ART    $800
150880  20th CENTURY BRITISH HISTORY   $1200
165110                     HIGH COUP   $1000
165197           TOUCHED BY AN ANGEL   $2000
170007               THE SWEET 1600s   $1600
174055               HISTORIC PEOPLE    $200
175259                     THE 1930s    $400
183462                       ROYALTY    None
186239              EUROPEAN HISTORY    $800
187651   CAPITALS OF THE WEST INDIES    $600
191579                       BATTLES    $800
192265    NORWAY'S CULTURE & HISTORY   $1600
192966                 HERO SANDWICH    $800
194516           THE YUCKS STOP HERE   $1600
200369               BRITISH HISTORY    $200

                                                 Question  \
4953    Both England's King George V & FDR put their s...
14912   This country's King Louis IV was nicknamed "Lo...
21511   this man and his son ruled England following t...
23810   William the Conqueror was crowned King of Engl...
27555   This member of the Medici family was the mothe...
33294   (Sarah of the Clue Crew delivers the clue from...
41148   This French king recognized William of Orange ...
41357   England's King Henry VIII had 3 wives named Ca...
43122              The father of England's King Edward VI
47814   This steak sauce was created for King George I...
49994   Elizabeth I's half-brother, he reigned before ...
51115   (<a href="http://www.j-archive.com/media/2000-...
51565   He wrote several anthems, including "The King ...
56600   This city known for its 24-hour auto race was ...
57516   Famous (& rather insulting) adjective for Engl...
58949   He became King of England in 1399 after forcin...
71808   Number of the William who was England's "Sailo...
74235   Barons & churchmen drew up this 1215 document ...
77195   He became King of England on June 26, 1483; ju...
79457   On Christmas Day 1066, he was crowned King of ...
80113   England's King Charles II was known by this "j...
84639   He went from second banana on "Roseanne" to to...
86412   This country's King Olaf V was born in England...
89710   This 11th Century King of England also ruled D...
111926  It begins "John, by the grace of God, King of ...
118809  In French this King of England is called Guill...
123299  If you want to be crowned King of England, thi...
123671                     King Henry VII of England dies
125822  Famous nickname of the eldest son of England's...
127484  Ethelred the Unready managed to lose most of E...
127758  This state was named for the King of England w...
129106  King Edward I of England, who fought William W...
130208  This "Sun King" sniffed, "England is a little ...
137818  The last King William to rule England had this...
143434  This Flemish artist painted a unique triple po...
150880  During Stanley Baldwin's term as P.M., this Ki...
165110  The 1st commoner to rule England, he became lo...
165197  The "Angel of Hadley" is said to have saved a ...
170007  In the 1697 Treaty of Rijswijk, the French rec...
174055  This conqueror was crowned King of England on ...
175259  His short reign as King of England fell in in ...
183462  A capital in the West Indies is named for this...
186239  He was King of England from 1189 to 1199 but s...
187651  This Bahamian capital took its name from the f...
191579  England's King Harold II lost the all-importan...
192265  (<a href="http://www.j-archive.com/media/2012-...
192966                 England's King _____ _____ R. Luce
194516  The "Monty Python" member who played King Arth...
200369  8th C. King Offa built a 170-mile north-south ...

                              Answer
4953    Philately (stamp collecting)
14912                         France
21511                Oliver Cromwell
23810                           1066
27555                Marie de Medici
33294   the Archbishop of Canterbury
41148                      Louis XIV
41357                 Catherine Parr
43122                     Henry VIII
47814                             A1
49994                      Edward VI
51115                    Magna Carta
51565         George Frideric Handel
56600                        Le Mans
57516                  "the Unready"
58949                       Henry IV
71808                             IV
74235                The Magna Carta
77195                    Richard III
79457          William the Conqueror
80113            "the Merry Monarch"
84639                   John Goodman
86412                         Norway
89710                         Canute
111926                   Magna Carta
118809         William the Conqueror
123299            the Stone of Scone
123671                          1509
125822              the Black Prince
127484                       Denmark
127758                       Georgia
129106                  "Longshanks"
130208                     Louis XIV
137818                            IV
143434              Anthony van Dyck
150880              King Edward VIII
165110               Oliver Cromwell
165197                   King Philip
170007             William of Orange
174055                       William
175259              King Edward VIII
183462                        Nassau
186239         Richard the Lionheart
187651                        Nassau
191579                          1066
192265                    Edward VII
192966                    John Henry
194516                Graham Chapman
200369                         Wales

49

In [27]:
# method to get all the question using apply
def check_words_question(row):
    text = str(row['Question'])
    re.search(r'^(?=.*King)(?=.*England)', text)
    if re.search(r'^(?=.*King)(?=.*England)', text):
        return text

df_with_king_and_england = jeopardy.apply(check_words_question, axis=1)

df_with_king_and_england = df_with_king_and_england.dropna()
print(df_with_king_and_england)
df_with_king_and_england.count()

4953      Both England's King George V & FDR put their s...
14912     This country's King Louis IV was nicknamed "Lo...
21511     this man and his son ruled England following t...
23810     William the Conqueror was crowned King of Engl...
27555     This member of the Medici family was the mothe...
33294     (Sarah of the Clue Crew delivers the clue from...
41148     This French king recognized William of Orange ...
41357     England's King Henry VIII had 3 wives named Ca...
43122                The father of England's King Edward VI
47814     This steak sauce was created for King George I...
49994     Elizabeth I's half-brother, he reigned before ...
51115     (<a href="http://www.j-archive.com/media/2000-...
51565     He wrote several anthems, including "The King ...
56600     This city known for its 24-hour auto race was ...
57516     Famous (& rather insulting) adjective for Engl...
58949     He became King of England in 1399 after forcin...
71808     Number of the William who was England's "Sailo...
74235     Barons & churchmen drew up this 1215 document ...
77195     He became King of England on June 26, 1483; ju...
79457     On Christmas Day 1066, he was crowned King of ...
80113     England's King Charles II was known by this "j...
84639     He went from second banana on "Roseanne" to to...
86412     This country's King Olaf V was born in England...
89710     This 11th Century King of England also ruled D...
111926    It begins "John, by the grace of God, King of ...
118809    In French this King of England is called Guill...
123299    If you want to be crowned King of England, thi...
123671                       King Henry VII of England dies
125822    Famous nickname of the eldest son of England's...
127484    Ethelred the Unready managed to lose most of E...
127758    This state was named for the King of England w...
129106    King Edward I of England, who fought William W...
130208    This "Sun King" sniffed, "England is a little ...
137818    The last King William to rule England had this...
143434    This Flemish artist painted a unique triple po...
150880    During Stanley Baldwin's term as P.M., this Ki...
165110    The 1st commoner to rule England, he became lo...
165197    The "Angel of Hadley" is said to have saved a ...
170007    In the 1697 Treaty of Rijswijk, the French rec...
174055    This conqueror was crowned King of England on ...
175259    His short reign as King of England fell in in ...
183462    A capital in the West Indies is named for this...
186239    He was King of England from 1189 to 1199 but s...
187651    This Bahamian capital took its name from the f...
191579    England's King Harold II lost the all-importan...
192265    (<a href="http://www.j-archive.com/media/2012-...
192966                   England's King _____ _____ R. Luce
194516    The "Monty Python" member who played King Arth...
200369    8th C. King Offa built a 170-mile north-south ...
dtype: object

49

In [28]:
jeopardy.Value.unique()

array(['$200', '$400', '$600', '$800', '$2,000', '$1000', '$1200',
       '$1600', '$2000', '$3,200', 'None', '$5,000', '$100', '$300',
       '$500', '$1,000', '$1,500', '$1,200', '$4,800', '$1,800', '$1,100',
       '$2,200', '$3,400', '$3,000', '$4,000', '$1,600', '$6,800',
       '$1,900', '$3,100', '$700', '$1,400', '$2,800', '$8,000', '$6,000',
       '$2,400', '$12,000', '$3,800', '$2,500', '$6,200', '$10,000',
       '$7,000', '$1,492', '$7,400', '$1,300', '$7,200', '$2,600',
       '$3,300', '$5,400', '$4,500', '$2,100', '$900', '$3,600', '$2,127',
       '$367', '$4,400', '$3,500', '$2,900', '$3,900', '$4,100', '$4,600',
       '$10,800', '$2,300', '$5,600', '$1,111', '$8,200', '$5,800',
       '$750', '$7,500', '$1,700', '$9,000', '$6,100', '$1,020', '$4,700',
       '$2,021', '$5,200', '$3,389', '$4,200', '$5', '$2,001', '$1,263',
       '$4,637', '$3,201', '$6,600', '$3,700', '$2,990', '$5,500',
       '$14,000', '$2,700', '$6,400', '$350', '$8,600', '$6,300', '$250',
       '$3,989', '$8,917', '$9,500', '$1,246', '$6,435', '$8,800',
       '$2,222', '$2,746', '$10,400', '$7,600', '$6,700', '$5,100',
       '$13,200', '$4,300', '$1,407', '$12,400', '$5,401', '$7,800',
       '$1,183', '$1,203', '$13,000', '$11,600', '$14,200', '$1,809',
       '$8,400', '$8,700', '$11,000', '$5,201', '$1,801', '$3,499',
       '$5,700', '$601', '$4,008', '$50', '$2,344', '$2,811', '$18,000',
       '$1,777', '$3,599', '$9,800', '$796', '$3,150', '$20', '$1,810',
       '$22', '$9,200', '$1,512', '$8,500', '$585', '$1,534', '$13,800',
       '$5,001', '$4,238', '$16,400', '$1,347', '$2547', '$11,200'],
      dtype=object)

In [29]:
# replacing 'one' because of [1:] and 'None'
jeopardy['Value_int'] = jeopardy.apply(lambda row: float(row.Value[1:].replace('one', '0').replace(',','')), axis=1)
jeopardy.Value_int.unique()

array([2.000e+02, 4.000e+02, 6.000e+02, 8.000e+02, 2.000e+03, 1.000e+03,
       1.200e+03, 1.600e+03, 3.200e+03, 0.000e+00, 5.000e+03, 1.000e+02,
       3.000e+02, 5.000e+02, 1.500e+03, 4.800e+03, 1.800e+03, 1.100e+03,
       2.200e+03, 3.400e+03, 3.000e+03, 4.000e+03, 6.800e+03, 1.900e+03,
       3.100e+03, 7.000e+02, 1.400e+03, 2.800e+03, 8.000e+03, 6.000e+03,
       2.400e+03, 1.200e+04, 3.800e+03, 2.500e+03, 6.200e+03, 1.000e+04,
       7.000e+03, 1.492e+03, 7.400e+03, 1.300e+03, 7.200e+03, 2.600e+03,
       3.300e+03, 5.400e+03, 4.500e+03, 2.100e+03, 9.000e+02, 3.600e+03,
       2.127e+03, 3.670e+02, 4.400e+03, 3.500e+03, 2.900e+03, 3.900e+03,
       4.100e+03, 4.600e+03, 1.080e+04, 2.300e+03, 5.600e+03, 1.111e+03,
       8.200e+03, 5.800e+03, 7.500e+02, 7.500e+03, 1.700e+03, 9.000e+03,
       6.100e+03, 1.020e+03, 4.700e+03, 2.021e+03, 5.200e+03, 3.389e+03,
       4.200e+03, 5.000e+00, 2.001e+03, 1.263e+03, 4.637e+03, 3.201e+03,
       6.600e+03, 3.700e+03, 2.990e+03, 5.500e+03, 1.400e+04, 2.700e+03,
       6.400e+03, 3.500e+02, 8.600e+03, 6.300e+03, 2.500e+02, 3.989e+03,
       8.917e+03, 9.500e+03, 1.246e+03, 6.435e+03, 8.800e+03, 2.222e+03,
       2.746e+03, 1.040e+04, 7.600e+03, 6.700e+03, 5.100e+03, 1.320e+04,
       4.300e+03, 1.407e+03, 1.240e+04, 5.401e+03, 7.800e+03, 1.183e+03,
       1.203e+03, 1.300e+04, 1.160e+04, 1.420e+04, 1.809e+03, 8.400e+03,
       8.700e+03, 1.100e+04, 5.201e+03, 1.801e+03, 3.499e+03, 5.700e+03,
       6.010e+02, 4.008e+03, 5.000e+01, 2.344e+03, 2.811e+03, 1.800e+04,
       1.777e+03, 3.599e+03, 9.800e+03, 7.960e+02, 3.150e+03, 2.000e+01,
       1.810e+03, 2.200e+01, 9.200e+03, 1.512e+03, 8.500e+03, 5.850e+02,
       1.534e+03, 1.380e+04, 5.001e+03, 4.238e+03, 1.640e+04, 1.347e+03,
       2.547e+03, 1.120e+04])

In [30]:
def search_for_question_with_word(word):
    regex = r".*" + re.escape(word) + r".*" # escape to backslash special characters
    df_with_word = jeopardy[jeopardy['Question'].str.contains(regex)]
    return df_with_word.Value_int.mean()


mean_with_king = search_for_question_with_word('King')
mean_with_king

773.4413965087282

In [31]:
df_with_king_mean_value = jeopardy[jeopardy['Question'].str.contains(r'.*King.*')]
df_with_king_mean_value.Value_int.mean()

773.4413965087282

In [32]:
df_with_king_mean_value.Value_int.count()

1604

In [33]:
df_with_king_mean_value.Value_int.sum()

1240600.0

In [34]:
# incorrect result, because of
# value_int = jeopardy.loc[(jeopardy['Question'] == question),'Value_int'].values
# when the same question appears more than 1 time with different values

def calculate_average_value_for_word(word):
    total_sum = 0
    total_count = 0

    unique_elements = {}

    list_questions = []

    for question in jeopardy['Question']:
        if word in question:
            list_questions.append(question)
            value_int = jeopardy.loc[(jeopardy['Question'] == question),'Value_int'].values
            #print(value_int)
            #print(len(value_int))

            if len(value_int) > 1:
                print("More than 1 value")
                print(question)
                print(value_int[0])
                print(value_int[1])
                #break
            if value_int[0] not in unique_elements.keys():
                unique_elements[value_int[0]] = 1
            else:
                unique_elements[value_int[0]] +=1
            total_sum += value_int[0]
            total_count += 1

    unique_elements_sorted = dict(sorted(unique_elements.items(), key=lambda item: item[1], reverse=True))
    print(unique_elements_sorted)
    #print(list_questions)
    if total_count == 0:
        return 0, list_questions
    else:
        print("Total sum: " + str(total_sum))
        print("Total count: " + str(total_count))

        return total_sum / total_count, list_questions

mean, list_of_questions_with_king_manual_approach =  calculate_average_value_for_word('King')
print(mean)

More than 1 value
I Kings uses "slept with his fathers" as a euphemism for this
800.0
800.0
More than 1 value
The number of times the words "apple" & "snake" appear in the King James Version of Genesis
400.0
300.0
More than 1 value
King Carl XVI Gustaf
400.0
800.0
More than 1 value
I Kings uses "slept with his fathers" as a euphemism for this
800.0
800.0
More than 1 value
It's the last name of father & son novelists Kingsley & Martin
1000.0
1200.0
More than 1 value
In the King James Version of John 3:16, "God so loved the world, that he gave" this
400.0
600.0
More than 1 value
In "King John", King John's first words to her are "Silence, good mother; hear the embassy"
1600.0
1000.0
More than 1 value
In the King James Version of John 3:16, "God so loved the world, that he gave" this
400.0
600.0
More than 1 value
In "King John", King John's first words to her are "Silence, good mother; hear the embassy"
1600.0
1000.0
More than 1 value
King Carl XVI Gustaf
400.0
800.0
More than 1 value
The number of times the words "apple" & "snake" appear in the King James Version of Genesis
400.0
300.0
More than 1 value
It's the last name of father & son novelists Kingsley & Martin
1000.0
1200.0
{400.0: 304, 800.0: 223, 200.0: 210, 1000.0: 182, 600.0: 172, 2000.0: 103, 1600.0: 98, 1200.0: 77, 500.0: 66, 100.0: 54, 300.0: 49, 0.0: 31, 1500.0: 6, 1400.0: 4, 4000.0: 3, 3000.0: 3, 2500.0: 3, 900.0: 2, 5000.0: 2, 1100.0: 1, 8200.0: 1, 2200.0: 1, 3500.0: 1, 1900.0: 1, 700.0: 1, 9000.0: 1, 4700.0: 1, 2400.0: 1, 4200.0: 1, 7000.0: 1, 5200.0: 1}
Total sum: 1240500.0
Total count: 1604
773.3790523690773

In [40]:
df_with_king_mean_value.Value_int.value_counts()

400.0     301
800.0     224
200.0     210
1000.0    182
600.0     173
2000.0    103
1600.0     97
1200.0     78
500.0      66
100.0      54
300.0      50
0.0        31
1500.0      6
1400.0      4
3000.0      3
2500.0      3
4000.0      3
5000.0      2
900.0       2
7000.0      1
4200.0      1
2400.0      1
4700.0      1
2200.0      1
9000.0      1
700.0       1
1900.0      1
3500.0      1
1100.0      1
8200.0      1
5200.0      1
Name: Value_int, dtype: int64

In [35]:
df_of_questions_with_king_manual_approach = pd.DataFrame(list_of_questions_with_king_manual_approach, columns=['Question'])
df_of_questions_with_king_manual_approach

                                               Question
0        It's the largest kingdom in the United Kingdom
1     Between 1842 & 1885, he repeatedly revised his...
2     Robin Quivers is the radio consort of this sel...
3     Examples of this TV format include "Leave It t...
4     Central Park has a statue of King Wladyslaw II...
...                                                 ...
1599  You have to stand up to ride Shockwave, this t...
1600  Stephen King's 1980 overview of the horror gen...
1601  Upon signing his name in 1776 he said, "There,...
1602  The first one of these tombs was built about 2...
1603  A Hoffmann tale title lost the words "And The ...

[1604 rows x 1 columns]

In [36]:
#df_with_king_mean_value.Question
df_of_questions_with_king_auto_approach = df_with_king_mean_value.Question.to_frame().reset_index(drop=True)
df_of_questions_with_king_auto_approach

                                               Question
0        It's the largest kingdom in the United Kingdom
1     Between 1842 & 1885, he repeatedly revised his...
2     Robin Quivers is the radio consort of this sel...
3     Examples of this TV format include "Leave It t...
4     Central Park has a statue of King Wladyslaw II...
...                                                 ...
1599  You have to stand up to ride Shockwave, this t...
1600  Stephen King's 1980 overview of the horror gen...
1601  Upon signing his name in 1776 he said, "There,...
1602  The first one of these tombs was built about 2...
1603  A Hoffmann tale title lost the words "And The ...

[1604 rows x 1 columns]

In [37]:
df_of_questions_with_king_manual_approach.Question.count()

1604

In [38]:
df_of_questions_with_king_auto_approach.Question.count()

1604

In [39]:
#diff = df_of_questions_with_king_auto_approach.compare(df_of_questions_with_king_manual_approach, keep_equal=True, keep_shape = True)
diff = df_of_questions_with_king_auto_approach.compare(df_of_questions_with_king_manual_approach)
diff

Empty DataFrame
Columns: []
Index: []

In [16]:
jeopardy['Question'].value_counts()

[audio clue]                                                                                               17
[video clue]                                                                                               14
(audio clue)                                                                                                5
[filler]                                                                                                    5
Hainan                                                                                                      4
                                                                                                           ..
In a Kipling ballad "East is east, and west is west, and never" these 4 words                               1
The Czechs call this 720-mile-long river the Labe                                                           1
You can still buy this character's cereal online                                                            1
The Black Knight plush figure from this British comedy film has detachable limbs                            1
A silent movie title includes the last name of this 18th c. statesman & favorite of Catherine the Great     1
Name: Question, Length: 216124, dtype: int64

In [17]:
jeopardy[jeopardy['Question'] == 'Hainan']

,Show Number,Air Date,Round,Category,Value,Question,Answer,Value_int
30116,4802,2005-06-21,Double Jeopardy!,"VOLCANO, ISLAND OR PENINSULA",$1200,Hainan,island,1200.0
144460,3949,2001-11-01,Jeopardy!,THE NEAREST CONTINENT,$200,Hainan,Asia,200.0
162552,5765,2009-10-09,Jeopardy!,COUNTRIES' LARGEST ISLANDS,$800,Hainan,China,800.0
203881,5131,2006-12-25,Double Jeopardy!,IT'S OUR ISLAND,$400,Hainan,China,400.0

In [18]:
df_with_king_mean_value[df_with_king_mean_value['Question'] == 'I Kings uses "slept with his fathers" as a euphemism for this']

,Show Number,Air Date,Round,Category,Value,Question,Answer,Value_int
15532,5468,2008-05-21,Jeopardy!,AROUND THE BIBLE,$800,"I Kings uses ""slept with his fathers"" as a eup...",death (or died),800.0
65307,4106,2002-06-10,Jeopardy!,AROUND THE BIBLE,$800,"I Kings uses ""slept with his fathers"" as a eup...",died,800.0

In [19]:
# now the result is correct
def calculate_average_value_for_word_2(word):
    total_sum = 0
    total_count = 0

    unique_elements = {}

    list_questions = []

    #for question in jeopardy['Question']:
    for question, value in zip(jeopardy['Question'],jeopardy['Value_int']):
        if word in question:
            list_questions.append(question)

            if value not in unique_elements.keys():
                unique_elements[value] = 1
            else:
                unique_elements[value] += 1
            total_sum += value
            total_count += 1

    unique_elements_sorted = dict(sorted(unique_elements.items(), key=lambda item: item[1], reverse=True))
    print(unique_elements_sorted)

    if total_count == 0:
        return 0, list_questions
    else:
        print("Total sum: " + str(total_sum))
        print("Total count: " + str(total_count))

        return total_sum / total_count, list_questions

mean, list_of_questions_with_king_manual_approach_2 =  calculate_average_value_for_word_2('King')
print(mean)

{400.0: 301, 800.0: 224, 200.0: 210, 1000.0: 182, 600.0: 173, 2000.0: 103, 1600.0: 97, 1200.0: 78, 500.0: 66, 100.0: 54, 300.0: 50, 0.0: 31, 1500.0: 6, 1400.0: 4, 4000.0: 3, 3000.0: 3, 2500.0: 3, 900.0: 2, 5000.0: 2, 1100.0: 1, 8200.0: 1, 2200.0: 1, 3500.0: 1, 1900.0: 1, 700.0: 1, 9000.0: 1, 4700.0: 1, 2400.0: 1, 4200.0: 1, 7000.0: 1, 5200.0: 1}
Total sum: 1240600.0
Total count: 1604
773.4413965087282

In [46]:
jeopardy.groupby(['Category'])['Value_int'].mean().sort_values()

Category
HOLLYWOOD SCANDALS             0.0
THE POST OFFICE                0.0
THE PRESIDENCY                 0.0
THE PRESIDENTIAL CABINET       0.0
SCOTTISH INVENTORS             0.0
                             ...
"A" IN MATH                 3640.0
REMEMBERING TED KENNEDY     3640.0
"A" SCIENCE CATEGORY        3900.0
STATE GEMS                  4000.0
PLUS 8                      4160.0
Name: Value_int, Length: 27995, dtype: float64

In [47]:
jeopardy[jeopardy['Category'] == 'HOLLYWOOD SCANDALS']

,Show Number,Air Date,Round,Category,Value,Question,Answer,Value_int
101210,5203,2007-04-04,Final Jeopardy!,HOLLYWOOD SCANDALS,None,"Some claim the 1932 ""suicide"" of this star's h...",Jean Harlow,0.0

In [51]:
jeopardy.groupby(['Category']).Category.count().sort_values()

Category
EUROPEAN LITERARY CLASSICS      1
TRANSPORTATION INNOVATIONS      1
POPULAR BABY NAMES              1
TRANSPORTATION HISTORY          1
ELVIS PRESLEY                   1
                             ...
POTPOURRI                     401
AMERICAN HISTORY              418
LITERATURE                    496
SCIENCE                       519
BEFORE & AFTER                547
Name: Category, Length: 27995, dtype: int64